NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_timer_scheduler.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdio.h>
#include "unity.h"
#include "timer_scheduler.h"
#include "timer.h"
#include "bearer_event.h"
#include "nrf_error.h"
#include "fifo.h"
#include "nrf_mesh.h"
#include "nrf_mesh_assert.h"

typedef struct
{
    bearer_event_callback_t cb;
    void* p_context;
} async_evt_t;

static bool             m_async_exec;
static timestamp_t      m_last_timer_order;
static timestamp_t      m_last_timestamp;
static timer_callback_t m_timer_cb;
static timestamp_t      m_time_now;
static uint32_t         m_ret_val;
static uint32_t         m_cb_count;
static  bearer_event_flag_callback_t m_flag_cb;
nrf_mesh_assertion_handler_t m_assertion_handler;

void assertion_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("Assertion handler called");
}

void setUp(void)
{
    m_assertion_handler = assertion_handler;
    m_time_now = 0;
    m_cb_count = 0;
    m_ret_val = NRF_SUCCESS;
    m_last_timestamp = 0xFFFFFFFF;
    m_last_timer_order = 0xFFFFFFFF;
    m_async_exec = false;
    timer_sch_init();
}

void tearDown(void)
{

}

/********************************/

static void timer_sch_cb(timestamp_t timestamp, void * p_context)
{
    m_last_timestamp = timestamp;
    m_cb_count++;
}

static void exec_async(void)
{
    m_flag_cb();
}

static void timer_callback_call_abort(uint32_t timestamp, void * p_context)
{
    TEST_ASSERT_NOT_NULL(p_context);
    timer_sch_abort((timer_event_t*) p_context);
}

static void timer_callback_call_reschedule(uint32_t timestamp, void * p_context)
{
    TEST_ASSERT_NOT_NULL(p_context);
    timer_sch_reschedule((timer_event_t*) p_context, timestamp + 4000);
}

static void timer_callback_call_reschedule_earlier(uint32_t timestamp, void * p_context)
{
    TEST_ASSERT_NOT_NULL(p_context);
    ((timer_event_t *) p_context)->cb = timer_sch_cb; /* change callback to avoid infinite recursion */
    timer_sch_reschedule((timer_event_t*) p_context, timestamp - 4000);
}

static void timer_callback_call_schedule(uint32_t timestamp, void * p_context)
{
    TEST_ASSERT_NOT_NULL(p_context);
    ((timer_event_t *) p_context)->timestamp += 4000;
    timer_sch_schedule((timer_event_t *) p_context);
}

static bool event_is_in_loop(timer_event_t * p_evt)
{
    for (uint32_t i = 0; i < 1000; i++)
    {
        if (p_evt == NULL)
        {
            return false;
        }
        p_evt = p_evt->p_next;
    }
    return true;
}
/********************************/

uint32_t timer_order_cb(uint8_t timer_index, timestamp_t timestamp, timer_callback_t cb, timer_attr_t attrs)
{
    TEST_ASSERT_EQUAL(1, timer_index);
    TEST_ASSERT_EQUAL(TIMER_ATTR_SYNCHRONOUS, attrs);
    m_last_timer_order = timestamp;
    m_timer_cb = cb;
    return m_ret_val;
}

timestamp_t timer_now(void)
{
    return m_time_now;
}

uint32_t bearer_event_flag_add(bearer_event_flag_callback_t callback)
{
    TEST_ASSERT_NOT_NULL(callback);
    m_flag_cb = callback;
    return 0;
}
void bearer_event_flag_set(uint32_t flag)
{
    TEST_ASSERT_EQUAL(0, flag);
    if (!m_async_exec)
    {
        m_flag_cb();
    }
}
/**********************************/

void test_timer_sch_add(void)
{
    TEST_NRF_MESH_ASSERT_EXPECT(timer_sch_schedule(NULL));
    timer_event_t evts[15];
    for (uint32_t i = 0; i < 15; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 0;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
    }

    /* single */
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(1000, m_last_timer_order);
    TEST_ASSERT_EQUAL(0, m_cb_count);
    m_time_now = 1000;

    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(1000, m_last_timestamp);

    /* multiple */
    timer_sch_schedule(&evts[1]);
    timer_sch_schedule(&evts[2]);
    timer_sch_schedule(&evts[3]);

    TEST_ASSERT_EQUAL(1, m_cb_count);
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(3, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 4000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(4, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

