NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_timer_scheduler.c
    /* wrong order */
    timer_sch_schedule(&evts[5]);
    timer_sch_schedule(&evts[7]);
    timer_sch_schedule(&evts[4]);
    timer_sch_schedule(&evts[6]);

    TEST_ASSERT_EQUAL(4, m_cb_count);
    m_time_now = 5000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(5, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 6000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(6, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 7000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(7, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 8000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(8, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_time_now = 8500;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(8, m_cb_count); /* unchanged */
    TEST_ASSERT_EQUAL(8000, m_last_timestamp);


    /* multifire */
    timer_sch_schedule(&evts[8]);
    timer_sch_schedule(&evts[9]);
    timer_sch_schedule(&evts[10]);

    TEST_ASSERT_EQUAL(8, m_cb_count);
    m_time_now = 11000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(11, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    /* too late */
    timer_sch_schedule(&evts[11]);
    TEST_ASSERT_EQUAL(11, m_cb_count);
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(12, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_time_now = 12000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(13, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    /* schedule while in add-queue */
    m_async_exec = true;
    m_time_now = 0;
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    /* This isn't legal */
    TEST_NRF_MESH_ASSERT_EXPECT(timer_sch_schedule(&evts[0]));
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[0].state);
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[0]));
}

void test_timer_sch_abort(void)
{
    TEST_NRF_MESH_ASSERT_EXPECT(timer_sch_abort(NULL));
    timer_event_t evts[13];
    for (uint32_t i = 0; i < 13; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 0;
        evts[i].p_next = NULL;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
    }

    /* not found */
    timer_sch_abort(&evts[0]);

    /* single head */
    timer_sch_schedule(&evts[0]);
    timer_sch_abort(&evts[0]);
    m_time_now = 1000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count);

    /* head with follower */
    timer_sch_schedule(&evts[1]);
    timer_sch_schedule(&evts[2]);
    timer_sch_abort(&evts[1]);
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count);
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);

    /* not head */
    timer_sch_schedule(&evts[3]);
    timer_sch_schedule(&evts[4]);
    timer_sch_schedule(&evts[5]);
    timer_sch_abort(&evts[4]);
    m_time_now = 4000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    m_time_now = 5000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    m_time_now = 6000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(3, m_cb_count);

    /* last */
    timer_sch_schedule(&evts[6]);
    timer_sch_schedule(&evts[7]);
    timer_sch_abort(&evts[7]);
    TEST_ASSERT_EQUAL(NULL, evts[6].p_next);
    m_time_now = 7000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(4, m_cb_count);
    m_time_now = 8000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(4, m_cb_count); /* unchanged */

    /* number N for N > 1 */
    timer_sch_schedule(&evts[8]);
    timer_sch_schedule(&evts[9]);
    timer_sch_schedule(&evts[10]);
    timer_sch_schedule(&evts[11]);
    timer_sch_abort(&evts[10]);
    m_time_now = 9000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(5, m_cb_count);
    m_time_now = 10000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(6, m_cb_count);
    m_time_now = 11000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(6, m_cb_count); /* unchanged */
    m_time_now = 12000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(7, m_cb_count);

    /* abort while in add-queue */
    m_async_exec = true;
    m_time_now = 0;
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    timer_sch_abort(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_IGNORED, evts[0].state);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[0].state);

    /* abort while in add-queue, then schedule before handling */
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    timer_sch_abort(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_IGNORED, evts[0].state);
    TEST_NRF_MESH_ASSERT_EXPECT(timer_sch_schedule(&evts[0]));
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_IGNORED, evts[0].state);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[0].state);

    /* abort while in add-queue, then reschedule before handling */
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    timer_sch_abort(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_IGNORED, evts[0].state);
    timer_sch_reschedule(&evts[0], 10000);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[0].state);
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[0]));
}

void test_timer_sch_reschedule(void)
{
    TEST_NRF_MESH_ASSERT_EXPECT(timer_sch_reschedule(NULL, 0));
    timer_event_t evts[15];
    for (uint32_t i = 0; i < 15; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 0;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
    }

    /* reschedule single */
    timer_sch_schedule(&evts[0]);
    timer_sch_reschedule(&evts[0], 1500);

    m_time_now = 1000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count);
    m_time_now = 1500;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[0].state);

